
q = ['Студент женского пола?',
     'Тёмные ли у человека волосы?',
     'Носит ли загадываемый человек очки?',
     'Курит ли студент?',
     'Студенту есть 18 лет?',
     'Студент живет в общежитии?'
     ]

people = {
    'Яна Зорина': ['да', 'да', 'да', 'да', 'да', 'да'],
    'Екатерина Гусева' : ['да', 'нет', 'нет', 'нет', 'да', 'да'],
    'Мария Улитина' : ['да', 'нет', 'нет', 'да', 'да', 'да'],
    'Анастасия Райнус' : ['да', 'нет', 'да', 'нет', 'да', 'нет'],
    'Наталья Торгович' : ['да', 'да', 'нет', 'да', 'нет', 'да'],
    'Анастасия Бакланова' : ['да', 'нет', 'нет', 'да', 'да', 'нет'],
    'Саина Николаева' : ['да', 'нет', 'да', 'да', 'да', 'да'],
    'Екатерина Ульянова' : ['да', 'да', 'нет', 'нет', 'нет', 'да'],
    'Елена Драчева' : ['да', 'да', 'нет', 'нет', 'да', 'да'],
    'Анастасия Королёва' : ['да', 'да', 'нет', 'да', 'да', 'да'],
    'Анна Иванова' : ['да', 'да', 'да', 'нет', 'да', 'да'],
    'Артур Калинин' : ['нет', 'да', 'да', 'нет', 'да', 'да'],
    'Константин Долгов' : ['нет', 'да', 'нет', 'нет', 'да', 'нет'],
    'Максим Ложкин' : ['нет', 'да', 'нет', 'да', 'да', 'нет'],
    'Андрей Горлов' : ['нет', 'нет', 'да', 'да', 'да', 'да'],
    'Кирилл Волкович' : ['нет', 'да', 'нет', 'да', 'да', 'да'],
    'Михаил Панин' : ['нет', 'нет', 'нет', 'да', 'да', 'нет'],
    'Максим Теребов' : ['нет', 'нет', 'нет', 'да', 'да', 'да'],
    'Виталий Суслопаров' : ['нет', 'да', 'да', 'нет', 'да', 'нет'],
    'Дан Крылов' : ['нет', 'да', 'нет', 'да', 'нет', 'да'],
    'Арсений Еремеев' : ['нет', 'да', 'да', 'да', 'нет', 'нет'],
    'Артём Сергеев' : ['нет', 'да', 'нет', 'нет', 'да', 'да'],
    'Арсений Максимов' : ['нет', 'нет', 'нет', 'нет', 'да', 'нет'],
    'Сергей Погорелов' : ['нет', 'да', 'нет', 'нет', 'нет', 'да'],
    'Андрей Гневашев' : ['нет', 'да', 'да', 'да', 'да', 'да'],
    'Александр Копытко' : ['нет', 'нет', 'да', 'нет', 'да', 'да'],
    'Иван Белоконь' : ['нет', 'нет', 'нет', 'нет', 'да', 'да']
}
people_dinamic = people.keys()


for i in range(6):
    print(q[i])
    ans = input('Введите ответ (да/нет): ')
    people_dinamic_new = []
    for j in people_dinamic:
        if people[j][i] == ans:
            people_dinamic_new.append(j)
    if len(people_dinamic_new) == 1:
        print('Человек угадан! Это', people_dinamic_new[0] + '!')
        break
    people_dinamic = people_dinamic_new
else:
    print('Такого человека нет в группе К3122(')